return [[
欢迎来到lovebox2d编辑器的帮助文档！
	lovebox2d是一个基于box2d的物理场景编辑器。使用它，可以轻松且可视的创建和编辑box2d的场景，
并以xml,lua-table,json等格式输出。
	本帮助文档将帮助你熟悉这个编辑器，并指导你完成些简单的场景制作。当然，当你掌握了它，你就可以轻松的构建你想象中的奇妙世界了！
	好了！让我们开始探索box2d的奇妙世界吧！

第一章 Box2d的基本概念
第二章 熟悉lovebox2d编辑器界面
	第一节 主菜单
		主菜单实际分为四个区域，第一个为系统区，包括存储，读取，后退，重做，存储单位，复制，粘贴几个按钮
	第二节 创建栏
	第三节 属性栏
	第四节 单位栏及预览
	第五节 历史栏
	第六节 背景网格、操作日志
第三章 创建刚体及编辑
	第一节 body简介
	第二节 fixture和shape简介
	第三节 刚体的创建
		1. 圆形
		2. 方形
		3. 多边形
		4. 直线
		5. 折线
		6. 曲线
	第四节 刚体的选择
		1. 单选
		2. 添加及切换
		3. 框选
		4. 全选及取消选择
	第五节 刚体的属性编辑
		1. 基本属性
		2. 用户数据
	第六节 刚体的编辑
		1. 移动及对齐
		2. 复制及粘贴
		3. 合并及拆分
		4. 删除及清屏
第四章 部件的编辑
	第一节 部件的基本属性
	第二节 部件的材质
	第三节 部件的用户数据
	第四节 形状的编辑
第五章 连接的创建和编辑
	第一节 连接的概念和种类
	第二节 绳索连接, 距离连接, 焊接连接
		1. 绳索连接
		2. 距离连接
		3. 焊接连接
	第三节 转动连接, 平移连接
		1. 转动连接
		2. 平移连接
	第四节 杠杆连接
	第五节 悬轮连接
	第六节 传动连接
	第七节 连接的锚点及编辑
第六章 应用测试
	第一节 世界重力和比例尺
	第二节 鼠标模式
	第三节 线性力和扭力的施加
第七章 单位及场景
	第一节 单位的创建
	第二节 存储、读取单位和场景
	第三节 场景拼接
第八章 其他
	第一节 碰撞回调
	第二节 碰撞分组
	第三节 爆炸性物体
	第四节 动力性物体
	第五节 绳索与弹簧
	第五节 软性物体


















































Alexar
]]